Repository: JIHUNJO123/onomastep
Catalog: lib/l10n/app_*.arb
Languages: es, ko, zh

# todayWord
source: Today's Word
es: Palabra del día
ko: 오늘의 단어
zh: 今日单词

source: Learning
es: Aprendizaje
ko: 학습
zh: 学习

# levelLearning
source: Categories
es: Categorías
ko: 카테고리
zh: 分类

source: All Words
es: Todas
ko: 전체 단어
zh: 全部单词

# viewAllWords
source: View all onomatopoeia
es: Ver todas las onomatopeyas
ko: 모든 의성어/의태어 보기
zh: 查看所有拟声词

source: Favorites
es: Favoritos
ko: 즐겨찾기
zh: 收藏

source: Saved words
es: Palabras guardadas
ko: 저장한 단어
zh: 已保存单词

source: Flashcard
es: Tarjetas
ko: 플래시카드
zh: 闪卡

source: Card learning
es: Aprender con tarjetas
ko: 카드 학습
zh: 卡片学习

source: Quiz
ko: 퀴즈
zh: 测验

source: Test yourself
es: Pon a prueba
ko: 실력 테스트
zh: 自我测试

source: Settings
es: Ajustes
ko: 설정
zh: 设置

source: Language
es: Idioma
ko: 언어
zh: 语言

source: Display Language
es: Idioma de visualización
ko: 표시 언어
zh: 显示语言

source: Select Language
es: Seleccionar idioma
ko: 언어 선택
zh: 选择语言

source: Display
es: Pantalla
ko: 화면
zh: 显示

source: Dark Mode
es: Modo oscuro
ko: 다크 모드
zh: 深色模式

source: Font Size
es: Tamaño de fuente
ko: 글자 크기
zh: 字体大小

source: Notifications
es: Notificaciones
ko: 알림
zh: 通知

source: Daily Reminder
es: Recordatorio diario
ko: 매일 알림
zh: 每日提醒

# dailyReminderDesc
source: Get reminded to study every day
es: Recibe recordatorios de estudio diarios
ko: 매일 학습 알림 받기
zh: 每天收到学习提醒

source: Remove Ads
es: Eliminar anuncios
ko: 광고 제거
zh: 移除广告

source: Ads Removed
es: Anuncios eliminados
ko: 광고 제거됨
zh: 广告已移除

# thankYou
source: Thank you for your support!
es: Gracias por tu apoyo!
ko: 지원해 주셔서 감사합니다!
zh: 感谢您的支持！

source: Buy
es: Comprar
ko: 구매
zh: 购买

source: Restore Purchase
es: Restaurar compra
ko: 구매 복원
zh: 恢复购买

source: Restoring...
es: Restaurando...
ko: 복원 중...
zh: 恢复中...

# purchaseSuccess
source: Purchase successful!
es: Compra exitosa!
ko: 구매 완료!
zh: 购买成功！

source: Loading...
es: Cargando...
ko: 로딩 중...
zh: 加载中...

source: Not available
es: No disponible
ko: 이용 불가
zh: 不可用

source: Info
es: Información
ko: 정보
zh: 信息

source: Version
es: Versión
ko: 버전
zh: 版本

source: Disclaimer
es: Aviso legal
ko: 면책조항
zh: 免责声明

# disclaimerText
source: This app uses data from JMdict (CC-BY-SA 4.0) and Tatoeba (CC-BY 2.0).
es: Esta app usa datos de JMdict (CC-BY-SA 4.0) y Tatoeba (CC-BY 2.0).
ko: 이 앱은 JMdict (CC-BY-SA 4.0)와 Tatoeba (CC-BY 2.0) 데이터를 사용합니다.
zh: 此应用使用JMdict (CC-BY-SA 4.0)和Tatoeba (CC-BY 2.0)数据。

source: Privacy Policy
es: Política de privacidad
ko: 개인정보 처리방침
zh: 隐私政策

source: Cannot load words
es: No se pueden cargar las palabras
ko: 단어를 불러올 수 없습니다
zh: 无法加载单词

source: No favorites yet
es: Aún no hay favoritos
ko: 즐겨찾기가 없습니다
zh: 还没有收藏

# tapHeartToSave
source: Tap the heart icon to save words
es: Toca el corazón para guardar palabras
ko: 하트를 눌러 단어를 저장하세요
zh: 点击心形图标保存单词

source: Added to favorites
es: Añadido a favoritos
ko: 즐겨찾기에 추가됨
zh: 已添加到收藏

source: Removed from favorites
es: Eliminado de favoritos
ko: 즐겨찾기에서 제거됨
zh: 已从收藏移除

source: Word Detail
es: Detalle de palabra
ko: 단어 상세
zh: 单词详情

source: Definition
es: Definición
ko: 정의
zh: 定义

source: Example
es: Ejemplo
ko: 예문
zh: 例句

source: Alphabetical
es: Alfabético
ko: 가나다순
zh: 字母顺序

source: Random
es: Aleatorio
ko: 무작위
zh: 随机

source: Tap to flip
es: Toca para voltear
ko: 탭하여 뒤집기
zh: 点击翻转

source: Previous
es: Anterior
ko: 이전
zh: 上一个

source: Next
es: Siguiente
ko: 다음
zh: 下一个

source: Question
es: Pregunta
ko: 문제
zh: 问题

source: Score
es: Puntuación
ko: 점수
zh: 分数

source: Quiz Complete!
es: Quiz completado!
ko: 퀴즈 완료!
zh: 测验完成！

source: Finish
es: Finalizar
ko: 완료
zh: 完成

source: Try Again
es: Intentar de nuevo
ko: 다시 시도
zh: 再试一次

source: Show Result
es: Ver resultado
ko: 결과 보기
zh: 查看结果

source: Word to Meaning
es: PalabraSignificado
ko: 단어 의미
zh: 单词意思

source: Meaning to Word
es: SignificadoPalabra
ko: 의미 단어
zh: 意思单词

# excellent
source: Excellent! Perfect score!
es: Excelente! Puntuación perfecta!
ko: 완벽해요!
zh: 太棒了！满分！

# great
source: Great job! Keep it up!
es: Muy bien! Sigue así!
ko: 잘했어요!
zh: 做得好！继续加油！

# good
source: Good effort! Keep practicing!
es: Buen trabajo! Sigue practicando!
ko: 좋아요! 계속 연습하세요!
zh: 不错！继续练习！

source: Keep practicing!
es: Sigue practicando!
ko: 계속 연습하세요!
zh: 继续练习！

# privacyPolicyContent
source: This app does not collect any personal information.
es: Esta app no recopila información personal.
ko: 이 앱은 개인정보를 수집하지 않습니다.
zh: 此应用不收集任何个人信息。

# restorePurchaseDesc
source: Restore your previous purchase.
es: Restaura compras anteriores.
ko: 이전 구매를 복원합니다.
zh: 恢复之前的购买。

source: Restore complete
es: Restauración completada
ko: 복원 완료
zh: 恢复完成

# noPurchaseFound
source: No previous purchase found
es: No se encontró ninguna compra anterior
ko: 이전 구매 내역이 없습니다
zh: 未找到之前的购买

# furiganaDisplayMode
source: Reading Display
es: Mostrar lectura
ko: 읽기 표시
zh: 读音显示

# parenthesesMode
source: Parentheses
es: Modo paréntesis
ko: 괄호 방식
zh: 括号方式

# furiganaMode
source: Ruby Style
es: Modo furigana
ko: 루비 방식
zh: 注音方式

# parenthesesExample
source: e.g. ドキドキ (dokidoki)
es: Ej: ドキドキ (dokidoki)
ko: 예: ドキドキ (dokidoki)
zh: 例：ドキドキ (dokidoki)

# furiganaExample
source: Reading above word
es: La lectura aparece sobre la palabra
ko: 단어 위에 읽기 표시
zh: 单词上方显示读音

# showFuriganaInList
source: Show Reading
es: Mostrar lectura
ko: 읽기 표시
zh: 显示读音

# showFuriganaInListDesc
source: Display reading in word list
es: Mostrar lectura en la lista
ko: 단어 목록에 읽기 표시
zh: 在列表中显示读音

source: Marketing
ko: 마케팅
zh: 营销

source: Support
es: Soporte
ko: 지원
zh: 支持

# cat_Abundance
source: Abundance
es: Abundancia
ko: 풍부함
zh: 丰富

# cat_AnimalSounds
source: Animal Sounds
es: Sonidos de animales
ko: 동물 소리
zh: 动物声音

# cat_AnxietyNervousness
source: Anxiety
es: Ansiedad/Nerviosismo
ko: 불안/긴장
zh: 焦虑/紧张

# cat_Chewing
source: Chewing
es: Masticar
ko: 씹기
zh: 咀嚼

# cat_CleanMessy
source: Clean/Messy
es: Limpio/Desordenado
ko: 깨끗함/지저분함
zh: 干净/杂乱

# cat_Confident
source: Confident
es: Confiado
ko: 자신감
zh: 自信

# cat_Drinking
source: Drinking
es: Beber
ko: 마시기
zh: 喝

# cat_FastQuick
source: Fast/Quick
es: Rápido
ko: 빠름
zh: 快速

# cat_FatigueSleepiness
source: Fatigue
es: Fatiga/Somnolencia
ko: 피로/졸음
zh: 疲劳/困倦

# cat_HeartbeatExcitement
source: Heartbeat
es: Latido/Emoción
ko: 심장박동/흥분
zh: 心跳/兴奋

# cat_HumanSounds
source: Human Sounds
es: Sonidos humanos
ko: 사람 소리
zh: 人声

# cat_HungerFullness
source: Hunger
es: Hambre/Saciedad
ko: 배고픔/배부름
zh: 饥饿/饱腹

# cat_ImpactSounds
source: Impact Sounds
es: Sonidos de impacto
ko: 충격 소리
zh: 撞击声

# cat_JumpingBouncing
source: Jumping
es: Saltar/Rebotar
ko: 점프/튀기
zh: 跳跃/弹跳

# cat_LazyCareless
source: Lazy
es: Perezoso
ko: 게으름
zh: 懒惰

# cat_LightShine
source: Light/Shine
es: Luz/Brillo
ko: 빛/반짝임
zh: 光/闪耀

# cat_MechanicalSounds
source: Mechanical
es: Sonidos mecánicos
ko: 기계 소리
zh: 机械声

# cat_NegativeEmotions
source: Negative
es: Emociones negativas
ko: 부정적 감정
zh: 消极情绪

# cat_OtherEating
source: Other Eating
es: Otras comidas
ko: 기타 먹기
zh: 其他进食

# cat_OtherEmotions
source: Other Emotions
es: Otras emociones
ko: 기타 감정
zh: 其他情绪

# cat_OtherMotion
source: Other Motion
es: Otros movimientos
ko: 기타 동작
zh: 其他动作

# cat_OtherSounds
source: Other Sounds
es: Otros sonidos
ko: 기타 소리
zh: 其他声音

# cat_OtherWeather
source: Other Weather
es: Otro clima
ko: 기타 날씨
zh: 其他天气

# cat_Others
source: Others
es: Otros
ko: 기타
zh: 其他

# cat_PainDiscomfort
source: Pain
es: Dolor/Malestar
ko: 통증/불편함
zh: 疼痛/不适

# cat_PositiveEmotions
source: Positive
es: Emociones positivas
ko: 긍정적 감정
zh: 积极情绪

# cat_RainSnow
source: Rain/Snow
es: Lluvia/Nieve
ko: 비/눈
zh: 雨/雪

# cat_Scarcity
source: Scarcity
es: Escasez
ko: 부족함
zh: 稀缺

# cat_ShakingSwaying
source: Shaking
es: Temblar/Balancear
ko: 흔들림
zh: 摇晃

# cat_Shape
source: Shape
es: Forma
ko: 모양
zh: 形状

# cat_ShyHesitant
source: Shy
es: Tímido/Vacilante
ko: 수줍음/망설임
zh: 害羞/犹豫

# cat_Size
source: Size
es: Tamaño
ko: 크기
zh: 大小

# cat_SlidingSlipping
source: Sliding
es: Deslizar
ko: 미끄러짐
zh: 滑动

# cat_SlowLeisurely
source: Slow
es: Lento
ko: 느림
zh: 缓慢

# cat_SoftHard
source: Soft/Hard
es: Suave/Duro
ko: 부드러움/딱딱함
zh: 软/硬

# cat_SpinningRolling
source: Spinning
es: Girar/Rodar
ko: 회전/구르기
zh: 旋转/滚动

# cat_StickySlippery
source: Sticky
es: Pegajoso/Resbaladizo
ko: 끈적임/미끌미끌
zh: 粘/滑

# cat_Temperature
source: Temperature
es: Temperatura
ko: 온도
zh: 温度

# cat_WalkingRunning
source: Walking
es: Caminar/Correr
ko: 걷기/달리기
zh: 走/跑

# cat_WaterLiquidSounds
source: Water
es: Sonidos de agua
ko: 물/액체 소리
zh: 水/液体声

# cat_WetDry
source: Wet/Dry
es: Mojado/Seco
ko: 젖음/마름
zh: 湿/干

# cat_Wind
source: Wind
es: Viento
ko: 바람
zh: 风

# cat_WindAirSounds
source: Wind/Air
es: Sonidos de viento
ko: 바람/공기 소리
zh: 风/空气声

source: Cancel
ko: 취소

source: Locked Content
ko: 잠긴 콘텐츠

# watchAdToUnlock
source: Watch a short video to unlock all words until midnight!
ko: 짧은 영상을 시청하면 자정까지 모든 단어가 잠금 해제됩니다!

source: Watch Ad
ko: 광고 보기

# adNotReady
source: Ad is not ready yet. Please try again.
ko: 광고가 준비되지 않았습니다. 다시 시도해 주세요.

# unlockedUntilMidnight
source: All words unlocked until midnight!
ko: 자정까지 모든 단어가 잠금 해제되었습니다!
